---
kind: other
id: Properties.T:Autodesk.Revit.DB.OpenOptions
source: html/d5c6b977-b4b4-e8d6-7276-2adf8bded018.htm
---
# OpenOptions Properties

Specifies whether a local file is allowed to be opened as read-only by a user other than its owner.